//         1. 一维数组定义方式

#include <iostream>
using namespace std;

int main()
{
    /*
        一维数组定义的三种方式：

    1. 数据类型  数组名[ 数组长度 ]; 
    2. 数据类型  数组名[ 数组长度 ] = { 值1，值2 ...};
    3. 数据类型  数组名[ ] = { 值1，值2 ...};
    */

// 1. 数据类型  数组名[ 数组长度 ]; 

   int arr[5];
   // 给数组中的元素进行赋值
   // 数组元素的下标是从0开始索引的
   arr[0] = 10;
   arr[1] = 20;
   arr[2] = 30;
   arr[3] = 40;
   arr[4] = 50;

    // 访问数据元素
    cout << arr[0] << endl;


// 2. 数据类型  数组名[ 数组长度 ] = { 值1，值2 ...};
    int arr2[5] = {10,20,30,40,50};
    
    // 如果数组元素少填了,会自动填充为0.

    // 利用循环 输出数组中的元素
    for(int i=0;i<5;i++)
    {
        cout << arr2[i] << endl;
    }

// 3. 数据类型  数组名[ ] = { 值1，值2 ...};
    int arr3[] = {90,80,70,60,50,40,30,20,10};

    for(int i=0;i<9;i++)
    {
        cout << arr3[i] << endl;
    }
    return 0;
}

/*
    C++ 11 里新增了一些功能:
 1. 省略=号 : int days[]{1,15};
 2. 大括号可为空.所有元素置零: float m[100]{}
*/
