#include <iostream>
using namespace std;
/*
            5. 位运算符

&       按位与      两个操作数同时为1结果为1
|       按位或      两个操作数只要有一个为1, 结果就为1
~       按位非      操作数为1,结果为0. 操作数为0,结果为1
^       按位异或    两个操作数相同, 结果为0; 不相同结果为1
<<      左移        右侧空位补0
>>      右移        左侧空位补符号位

*/

/*      AND 和 OR 和 XOR  运算符
         &     |     ^
    作用：将数字转换为二进制运算，再输出十进制
    &、 | 和 ^ 的真值表如下所示:
    a     b      a&b      a|b      a^b
    0     0       0        0        0
    0     1       0        1        1
    1     1       1        1        0
    1     0       0        1        1
*/

int main()
{
    // 1.按位与
    cout << (4 & 5) << endl;     // 4
    /*
    转 2 进制的话: 4 是 100, 5 是 101
    100
    101
   =100
   所以等于 4 
   */
----------------------------------------------------------------------------------------------------------------------------------
    // 2.按位非
    cout << ~2;  // -3
    /*
    1.二进制取反:
        00000010    以0开头为整数
取反后: 11111101     以1开头为负数
    2.负数2进制转10进制:
    将2进制取反+1, 结果为负:
    00000010 + 1 = 11 = -3
    */
--------------------------------------------------------------------------------------------------------------------------------------
    // 3.左移
    cout << (2 << 3) << endl;   // 10000
    /*
    本来是 10, 要左移3位,离小数点, 所以是 10000
    */
-----------------------------------------------------------------------------------------------------------------------------------
    // 4.右移
    cout << (16 >> 2)   // 4
    /*
    本是 10000, 右移2位就是 100.00 , 100转10进制就是 4 
    */
   
    return 0;
}

