/*       8.6 const修饰指针

const修饰指针有三种情况

1. const修饰指针   --- 常量指针
2. const修饰常量   --- 指针常量
3. const即修饰指针，又修饰常量
*/
#include <iostream>
using namespace std;

int main() 
{
	int a = 10;
	int b = 10;

	// 1. const修饰指针   --- 常量指针: 指针指向可以改(也就是说可以指向别的变量)，但指针指向的值不可以更改
	const int * p1 = &a; 	// 现在指向的是a,值也是a的.
	p1 = &b; //正确	可以指向b
	//*p1 = 100;  报错，因为不能改值
	

	// 2. const修饰常量   --- 指针常量：const修饰的是常量，指针指向不可以改，指针指向的值可以更改
	int * const p2 = &a;
	//p2 = &b; //错误，因为指向不能改
	*p2 = 100; //正确

    // 3.const即修饰指针，又修饰常量：特点： const既修饰指针又修饰常量。指针的指向和指针指向的值都不能改。
	const int * const p3 = &a;
	//p3 = &b; //错误
	//*p3 = 100; //错误

	return 0;
}
//  技巧：看const右侧紧跟着的是指针还是常量, 是指针就是常量指针，是常量就是指针常量