/*  2.三目运算符

** 作用： 通过三目运算符实现简单的判断

** 语法：表达式1 ? 表达式2 ：表达式3

** 解释: 

如果表达式1的值为真，执行表达式2，并返回表达式2的结果；

如果表达式1的值为假，执行表达式3，并返回表达式3的结果。
*/
#include <iostream>
using namespace std;

int main()
{
    // 创建三个变量 a b c
    // 将 a 和 b 做比较，将变量大的值赋值给变量c

    int a = 10;
    int b = 20;
    int c = 0;

    c = (a > b ? a : b);  //意思是：若a大于b,会将a的值赋给c,若不是，则赋b的值

    cout << "c = " << c << endl;

    // 在C++中三目运算符返回的是变量，可以继续赋值
    (a > b ? a : b) = 100;    //在这里b的值赋到了100
    cout << "a= " << a << endl;
    cout << "b= " << b << endl;


    return 0;
} //总结：和if语句比较，三目运算符优点是短小整洁，缺点是如果用嵌套，结构不清晰