/*
          敲桌子

案例描述：从1开始数到数字100， 如果数字个位含有7，或者数字十位含有7，
或者该数字是7的倍数，我们打印敲桌子，其余数字直接打印输出。
*/
#include <iostream>
using namespace std;

/*
解题思路：
    1. 先输出 1 到 100 这些数字
    2.从这些数字中找到特殊数字，改为敲桌子

    特殊数字：

    7 的倍数        (7,14,21,28...)   % 7 = 0
    个位有7         (17,27,37.....)   % 10 =7
    十位有7         (71,72,73.....)   / 10 =7
    */
int main()
{
    for(int i = 1; i <= 100; i++)
    {
        if(i%7==0 || i%10==7 || i/10==7)
        {
            cout << "Knock Kncok" << endl;
        }
        else 
        {
            cout << i << endl;
        }
    }
    return 0;
}